-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Июн 04 2020 г., 23:01
-- Версия сервера: 10.3.13-MariaDB
-- Версия PHP: 7.1.22

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `k-telecom-test`
--

-- --------------------------------------------------------

--
-- Структура таблицы `clients`
--

CREATE TABLE `clients` (
  `id` int(11) NOT NULL,
  `name` text CHARACTER SET cp1251 NOT NULL,
  `surname` text CHARACTER SET cp1251 NOT NULL,
  `middle_name` text CHARACTER SET cp1251 NOT NULL,
  `passport_series` varchar(255) CHARACTER SET cp1251 NOT NULL,
  `passport_number` varchar(255) CHARACTER SET cp1251 NOT NULL,
  `birth_date` date NOT NULL,
  `phone` varchar(255) CHARACTER SET cp1251 NOT NULL,
  `email` varchar(255) CHARACTER SET cp1251 NOT NULL,
  `dtc` datetime NOT NULL DEFAULT current_timestamp(),
  `dtu` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

--
-- Дамп данных таблицы `clients`
--

INSERT INTO `clients` (`id`, `name`, `surname`, `middle_name`, `passport_series`, `passport_number`, `birth_date`, `phone`, `email`, `dtc`, `dtu`) VALUES
(160, 'Александр', 'Боровиков', 'Олегович', '5076', '939472', '1987-05-28', '82283697484', 'email0@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(161, 'Александр', 'Боровиков', 'Олегович', '1989', '176212', '1965-08-20', '85589895649', 'email1@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(162, 'Александр', 'Боровиков', 'Олегович', '7780', '271437', '1968-04-01', '86237275274', 'email2@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(163, 'Александр', 'Боровиков', 'Олегович', '5985', '546448', '1958-01-27', '82896818752', 'email3@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(164, 'Александр', 'Боровиков', 'Олегович', '9845', '166990', '1996-07-06', '85531927682', 'email4@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(165, 'Александр', 'Боровиков', 'Олегович', '4730', '587986', '1991-03-27', '81314464088', 'email5@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(166, 'Александр', 'Боровиков', 'Олегович', '2159', '916500', '1989-03-04', '81140314693', 'email6@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(167, 'Александр', 'Боровиков', 'Олегович', '6418', '517779', '1953-05-16', '83911048167', 'email7@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(168, 'Александр', 'Боровиков', 'Олегович', '2393', '919216', '2002-03-06', '85200455385', 'email8@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(169, 'Александр', 'Боровиков', 'Олегович', '3576', '420260', '2005-08-26', '86600930864', 'email9@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(170, 'Александр', 'Боровиков', 'Олегович', '8080', '603418', '1983-09-19', '88120163764', 'email10@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(171, 'Александр', 'Боровиков', 'Олегович', '9115', '893377', '1955-03-22', '82440651392', 'email11@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(172, 'Александр', 'Боровиков', 'Олегович', '1515', '954407', '2001-07-24', '88194465039', 'email12@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(173, 'Александр', 'Боровиков', 'Олегович', '6471', '432938', '1953-03-06', '82267890453', 'email13@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(174, 'Александр', 'Боровиков', 'Олегович', '9816', '922118', '1967-09-18', '84445145069', 'email14@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(175, 'Александр', 'Боровиков', 'Олегович', '2963', '296361', '1986-03-10', '85110307481', 'email15@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(176, 'Александр', 'Боровиков', 'Олегович', '6046', '801650', '1982-10-14', '83185732651', 'email16@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(177, 'Александр', 'Боровиков', 'Олегович', '5712', '383470', '1960-12-16', '82774731004', 'email17@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(178, 'Александр', 'Боровиков', 'Олегович', '1308', '415722', '2002-12-15', '82764145589', 'email18@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(179, 'Александр', 'Боровиков', 'Олегович', '1934', '935162', '2006-09-23', '81838137232', 'email19@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(180, 'Александр', 'Боровиков', 'Олегович', '7884', '343954', '1960-04-11', '82262665995', 'email20@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(181, 'Александр', 'Боровиков', 'Олегович', '8509', '671484', '1981-01-22', '88767938614', 'email21@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(182, 'Александр', 'Боровиков', 'Олегович', '4778', '402384', '1997-10-12', '81097773622', 'email22@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(183, 'Александр', 'Боровиков', 'Олегович', '4170', '219609', '1987-09-18', '89376977326', 'email23@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(184, 'Александр', 'Боровиков', 'Олегович', '9019', '938028', '1963-08-28', '89107507676', 'email24@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(185, 'Александр', 'Боровиков', 'Олегович', '5848', '656559', '1981-02-16', '85432578438', 'email25@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(186, 'Александр', 'Боровиков', 'Олегович', '1487', '537948', '1958-09-21', '82302100823', 'email26@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(187, 'Александр', 'Боровиков', 'Олегович', '5449', '667825', '1961-04-11', '82210158868', 'email27@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(188, 'Александр', 'Боровиков', 'Олегович', '5059', '824026', '1982-07-15', '85052124489', 'email28@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(189, 'Александр', 'Боровиков', 'Олегович', '2136', '601362', '1981-07-23', '82149409421', 'email29@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(190, 'Александр', 'Боровиков', 'Олегович', '4755', '648719', '1965-05-25', '84935730425', 'email30@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(191, 'Александр', 'Боровиков', 'Олегович', '2254', '152456', '1963-01-31', '83560709208', 'email31@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(192, 'Александр', 'Боровиков', 'Олегович', '5396', '586981', '1965-01-14', '85279162171', 'email32@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(193, 'Александр', 'Боровиков', 'Олегович', '3745', '624106', '1993-01-19', '87206164635', 'email33@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(194, 'Александр', 'Боровиков', 'Олегович', '1217', '130318', '1981-03-21', '88877174286', 'email34@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(195, 'Александр', 'Боровиков', 'Олегович', '5237', '643709', '1989-03-19', '87056569179', 'email35@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(196, 'Александр', 'Боровиков', 'Олегович', '8339', '196624', '1966-12-13', '83145428252', 'email36@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(197, 'Александр', 'Боровиков', 'Олегович', '1528', '285276', '1959-03-14', '84735370892', 'email37@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(198, 'Александр', 'Боровиков', 'Олегович', '2364', '730984', '1994-02-06', '87077630772', 'email38@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(199, 'Александр', 'Боровиков', 'Олегович', '3434', '655871', '2009-10-14', '84017712644', 'email39@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(200, 'Александр', 'Боровиков', 'Олегович', '7557', '453744', '2007-12-17', '87392803916', 'email40@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(201, 'Александр', 'Боровиков', 'Олегович', '9290', '416578', '1971-09-14', '83507200556', 'email41@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(202, 'Александр', 'Боровиков', 'Олегович', '5087', '138600', '2003-03-11', '89058699686', 'email42@email.com', '2020-06-04 21:41:42', '2020-06-05 00:42:32'),
(203, 'Александр', 'Боровиков', 'Олегович', '6779', '550296', '1963-06-27', '88201136185', 'email43@email.com', '2020-06-04 21:41:42', '2020-06-04 22:51:17'),
(204, 'Александр', 'Кузнецов', 'Сергеевич', '2658', '889654', '1983-11-07', '85994129158', 'email74@email.com', '2020-06-04 21:41:42', '2020-06-05 00:30:39'),
(205, 'Александр', 'Боровиков', 'Олегович', '3752', '422792', '1953-07-06', '85666852584', 'email45@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(206, 'Александр', 'Боровиков', 'Олегович', '8533', '328627', '1956-06-12', '88516634312', 'email46@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(207, 'Александр', 'Боровиков', 'Олегович', '3739', '595665', '1971-02-13', '88012709162', 'email47@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(208, 'Александр', 'Боровиков', 'Олегович', '5877', '316558', '1972-07-05', '81351354167', 'email48@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(209, 'Александр', 'Боровиков', 'Олегович', '4913', '426061', '1962-03-21', '83572567906', 'email49@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(210, 'Александр', 'Боровиков', 'Олегович', '3562', '165326', '1955-06-07', '88381943992', 'email50@email.com', '2020-06-04 21:41:42', '2020-06-04 21:41:42'),
(213, 'Алексей', 'Боровиков', 'Олексеевич', '2456', '235468', '2000-12-12', '89875639898', 'email@email.com', '2020-06-04 22:45:40', '2020-06-05 00:03:07'),
(215, 'Алексей', 'Кратько', 'Иванович', '2478', '649985', '2010-03-03', '89569563232', 'email@email.com', '2020-06-04 23:11:58', '2020-06-04 23:11:58'),
(216, 'Олег', 'Олежко', 'Сергеевич', '5646', '655655', '1957-03-02', '89569563232', 'email@email.com', '2020-06-04 23:15:10', '2020-06-04 23:22:18'),
(217, 'Егор', 'Рожков', 'Юрьевич', '4654', '987432', '1983-11-12', '89075043727', 'egor.ser@mail.ru', '2020-06-05 00:56:49', '2020-06-05 00:57:13');

--
-- Триггеры `clients`
--
DELIMITER $$
CREATE TRIGGER `before_delete_clients` BEFORE DELETE ON `clients` FOR EACH ROW BEGIN
	SIGNAL SQLSTATE '45000' SET MESSAGE_TEXT = 'DELETE canceled'; 
END
$$
DELIMITER ;

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `login` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `login`, `password`) VALUES
(1, 'admin', 'root1234');

--
-- Триггеры `users`
--
DELIMITER $$
CREATE TRIGGER `before_delete_users` BEFORE DELETE ON `users` FOR EACH ROW BEGIN
    SIGNAL SQLSTATE '45000' SET MESSAGE_TEXT = 'DELETE canceled'; 
END
$$
DELIMITER ;

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `clients`
--
ALTER TABLE `clients`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `clients`
--
ALTER TABLE `clients`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=218;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
